# Dev tools
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "chromedriver"
brew "libpq" # PostgreSQL support
brew "redis"
brew "sqlite"
cask "visual-studio-code"
brew "watch"
brew "yadm"
cask "google-cloud-sdk"
cask "dbeaver-community"
brew "pyenv"

# Git-based tools
brew "gh"
brew "git"

# CLI / Bash
brew "cmake"
brew "curl"
brew "fzf"
brew "gpg"
brew "httpie"
brew "thefuck"
brew "zsh"

# Languages / Language Tools
brew "go"
brew "python"
brew "python@3.7"
brew "rbenv"
brew "ruby-build"

# Random
brew "openssl@1.1"
